In [13]:
#positional argument
def greet(name,age):
  print(f"my name is {name}  and my age is {age}")

In [14]:
greet("black widow",33)

my name is black widow  and my age is 33

In [16]:
#keyword argument
greet(name="Thanos",age="200")

my name is Thanos  and my age is 200

In [20]:
#default  arguments
def greet(name,age=10):
 print(f"my name is {name} and my age is {age}")

In [23]:
greet("nobody", 12)

my name is nobody and my age is 12

In [25]:
#variable  length positional arguments
def summation(*arg):
    return sum(arg)

In [26]:
summation(1,2,34,4)

41

In [29]:
summation(*[i for i in range (1,19)])

171

In [27]:
summation(1,22,76,778)

877

In [40]:
#variable length keyword argument
def person(**karg):
    for k,v in karg.items():
     print(k,v)

In [41]:
person(name="flash",age=23)

name flash
age 23

In [42]:
#write two functions that takes two numbers as arguments and return their sum

def summation(*arg):
    return sum(arg)

In [43]:
summation(5,8)

13

In [44]:
#find maximum write a def function that take two number as aarguments and return the large of the two 
def find_larger_number(num1, num2):
    
    if num1 > num2:
        return f"The larger number is {num1}."
    elif num2 > num1:
        return f"The larger number is {num2}."
    else:
        return "Both numbers are equal."

In [49]:
print("find_largest _number"10,30,50,60")

SyntaxError: unterminated string literal (detected at line 1) (4117690473.py, line 1)

In [4]:
# check  even or odd
if number % 2 == 0:
     return f"{number} is Even"
else:
    return f"{number} is Odd"

 number= int(input("Enter a number: "))
print(result)

IndentationError: unindent does not match any outer indentation level (<string>, line 7)

In [ ]:
#clACULATE FACTORIAL

In [51]:
#REVERSE THE STRING
d = {'a': 1, 'b': 2, 'c': 3}

# Swap keys and values using dictionary comprehension
swapped = {v: k for k, v in d.items()}

# Print the swapped dictionary
print(swapped)

{1: 'a', 2: 'b', 3: 'c'}

In [53]:
#CHECK THE PALINDROM
def palindrome(number):
    a=str(number)
    if a==a[::-1]:
        print("palindrome")
    else:
        print("not palindrome")

In [54]:
palindrome("aba")

palindrome

In [ ]:
#some questions from the pic

In [11]:
#
l=[2,5,8,2]


for i in range(len(l)):
    if l[0]<l[i]:
       l[0]=l[i]

print(l[0])

8

In [20]:
#laambda function
cube =lambda x:x**3

In [21]:
print(cube(3))

27

In [ ]:
 new library  seaborn

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [3]:
titanic=sns.load_dataset("titanic")

In [4]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
#first 5 rows
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
#last 5 rows
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
# total number of rows and column 
titanic.shape

(891, 15)

In [10]:
# to perform functions like min , max , mean ,median  ,%,count on the given  data 
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
titanic.describe(include="object")

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

In [12]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [15]:
titanic.isnull().sum()/titanic.shape[0]*100

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64